
&НаКлиенте
Процедура ВидДействияПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	Элементы.СтраницаПроизвольныйАлгоритм.Видимость 
		= Объект.ВидДействия = ПредопределенноеЗначение("Перечисление.пс_ВидыДействийАлгоритмов.ПроизвольныйАлгоритм");
	Элементы.СтраницаПодключениеФайла.Видимость
		= Не Элементы.СтраницаПроизвольныйАлгоритм.Видимость 
			И ЗначениеЗаполнено(Объект.ВидДействия); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры
