#Область ОписаниеПеременных

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если пс_ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     пс_ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   пс_ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   пс_ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;

// библитека "Подключаемые скрипты"
Перем пс_ПараметрыПриложения Экспорт;





#КонецОбласти

//@skip-warning
&После("ПередНачаломРаботыСистемы")
Процедура пс_ПередНачаломРаботыСистемы(Отказ)
	пс_СкриптыКлиент.ПередНачаломРаботыСистемы();
КонецПроцедуры


