

// При первом обращении помещает двоичные данные во временное хранилише и кеширует на сервере
//
// Возвращаемое значение:
//   Строка   - Адрес временного хранилища, где лежат двоичные данные подключаемого расширения скриптов
//
Функция АдресОсновногоРасширенияСкриптов() Экспорт 

	Скрипт = ПолучитьОбщийМакет("пс_ПодключаемыеСкрипты");
	Поток = Новый ПотокВПамяти;
	// отключаем проверку парава "Вывод"
	УстановитьПривилегированныйРежим(Истина);
	Скрипт.Записать(Поток);
	Возврат ПоместитьДанныеВоВременноеХранилище(Поток.ЗакрытьИПолучитьДвоичныеДанные());

КонецФункции // АдресОсновногоРасширенияСкриптов()

Функция АдресАрхиваРедактораКода() Экспорт
	
	Архив = Обработки.пс_РедакторКода.ПолучитьМакет("Monaco1C");
	Возврат ПоместитьДанныеВоВременноеХранилище(Архив);
	
КонецФункции

Функция ПоместитьДанныеВоВременноеХранилище(Данные)
	Возврат ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор);	
КонецФункции

#Область Удалить

// Возвращает массив, содержащий полные имена всеф управляемых форм конфигурации
//
// Возвращаемое значение:
//   Массив   - Массив имён форм
//
Функция ПолучитьИменаВсехФорм() Экспорт 

	СписокФорм = Новый Массив;
	Для Каждого текФорма Из Метаданные.ОбщиеФормы Цикл
		СписокФорм.Добавить(текФорма.ПолноеИмя());
	КонецЦикла;
	Для Каждого текКонстанта Из Метаданные.Константы Цикл
		Если ТипЗнч(текКонстанта.ОсновнаяФорма) = Тип("ФормаКлиентскогоПриложения") Тогда
			СписокФорм.Добавить(текКонстанта.ОсновнаяФорма.ПолноеИмя());	
		КонецЕсли;		
	КонецЦикла;
	Для Каждого текКритерий Из Метаданные.КритерииОтбора Цикл
		Для Каждого текФорма Из текКритерий.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого текХранилище Из Метаданные.ХранилищаНастроек Цикл
		Для Каждого текФорма Из текХранилище.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого текСправочник Из Метаданные.Справочники Цикл
		Для Каждого текФорма Из текСправочник.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого текДокумент Из Метаданные.Документы Цикл
		Для Каждого текФорма Из текДокумент.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого текДокумент Из Метаданные.Документы Цикл
		Для Каждого текФорма Из текДокумент.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого ТекЖурнал Из Метаданные.ЖурналыДокументов Цикл
		Для Каждого текФорма Из ТекЖурнал.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого текПеречисление Из Метаданные.Перечисления Цикл
		Для Каждого текФорма Из текПеречисление.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого текОтчет Из Метаданные.Отчеты Цикл
		Для Каждого текФорма Из текОтчет.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текОбработка Из Метаданные.Обработки Цикл
		Для Каждого текФорма Из текОбработка.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текПланВидов Из Метаданные.ПланыВидовХарактеристик Цикл
		Для Каждого текФорма Из текПланВидов.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текПланВидов Из Метаданные.ПланыВидовРасчета Цикл
		Для Каждого текФорма Из текПланВидов.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текПланОбмена Из Метаданные.ПланыОбмена  Цикл
		Для Каждого текФорма Из текПланОбмена.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текПланСчетов Из Метаданные.ПланыСчетов  Цикл
		Для Каждого текФорма Из текПланСчетов.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текРегистр Из Метаданные.РегистрыСведений Цикл
		Для Каждого текФорма Из текРегистр.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текРегистр Из Метаданные.РегистрыНакопления Цикл
		Для Каждого текФорма Из текРегистр.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текРегистр Из Метаданные.РегистрыБухгалтерии Цикл
		Для Каждого текФорма Из текРегистр.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текРегистр Из Метаданные.РегистрыРасчета Цикл
		Для Каждого текФорма Из текРегистр.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текПроцесс Из Метаданные.БизнесПроцессы Цикл
		Для Каждого текФорма Из текПроцесс.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	Для Каждого текЗадача Из Метаданные.Задачи Цикл
		Для Каждого текФорма Из текЗадача.Формы Цикл
			Если текФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая Тогда
				СписокФорм.Добавить(текФорма.ПолноеИмя());		
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;

	Возврат СписокФорм;
	
	
КонецФункции // ПолучитьИменаВсехФорм()



#КонецОбласти




