
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пс_Скрипты.ИнициализироватьРедакторКода(Элементы.ХТМЛ);
//	Объект.ХТМЛ = "C:\Users\d_saveliev\Downloads\New folder\index.html"; 
КонецПроцедуры

&НаКлиенте
Процедура ХТМЛДокументСформирован(Элемент)
	Результат = пс_СкриптыКлиент.ВыполнитьКоманду("monaco.languages.getLanguages()",Элементы.ХТМЛ);
	Для Каждого текЯзык Из Результат Цикл
		Элементы.Язык.СписокВыбора.Добавить(текЯзык.id);		
	КонецЦикла;
	Язык = пс_СкриптыКлиент.ВыполнитьКоманду("scriptEdit.getModel().getLanguageIdentifier().language;",Элементы.ХТМЛ);
КонецПроцедуры

&НаКлиенте
Процедура ЯзыкПриИзменении(Элемент)
	пс_СкриптыКлиент.ВыполнитьКоманду(СтрШаблон(
	"monaco.editor.setModelLanguage(scriptEdit.getModel(),'%1')", Язык)
	, Элементы.ХТМЛ);
КонецПроцедуры



















