
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пс_Скрипты.ИнициализироватьРедакторКода(Элементы.ХТМЛ);
	РедактируемыйТекст = Параметры.РедактируемыйТекст; 
КонецПроцедуры

&НаКлиенте
Процедура ХТМЛДокументСформирован(Элемент)
	Результат = пс_СкриптыКлиент.ВыполнитьКоманду("monaco.languages.getLanguages()");
	Для Каждого текЯзык Из Результат Цикл
		Элементы.Язык.СписокВыбора.Добавить(текЯзык.id);		
	КонецЦикла;
	Язык = пс_СкриптыКлиент.ВыполнитьКоманду("scriptEdit.getModel().getLanguageIdentifier().language;");
	пс_СкриптыКлиент.ВыполнитьКоманду(СтрШаблон("scriptEdit.getModel().setValue('%1')", РедактируемыйТекст));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	пс_СкриптыКлиент.УстановитьПолеХТМЛПоУмолчанию(Элементы.ХТМЛ);
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	Закрыть(пс_СкриптыКлиент.ВыполнитьКоманду("scriptEdit.getModel().getValue()"));
КонецПроцедуры


&НаКлиенте
Процедура ЯзыкПриИзменении(Элемент)
	пс_СкриптыКлиент.ВыполнитьКоманду(СтрШаблон(
	"monaco.editor.setModelLanguage(scriptEdit.getModel(),'%1')", Язык));
КонецПроцедуры



















