
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	пс_Скрипты.ИнициализироватьРедакторМонако(Элементы.ХТМЛ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ИнициироватьРедактор", 2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИнициироватьРедактор()
	СписокДоступныхЯзыков = пс_СкриптыКлиент.ВыполнитьКоманду("monaco.languages.getLanguages()", Элементы.ХТМЛ);
	Если ТипЗнч(СписокДоступныхЯзыков) = Тип("ВнешнийОбъект") Тогда
		Для Каждого текЯзык Из СписокДоступныхЯзыков Цикл
			ИД = текЯзык.id;
			Синоним = "";
			Синонимы = текЯзык.aliases;
			Если ТипЗнч(Синонимы) = Тип("ВнешнийОбъект") Тогда
				Синоним = пс_СкриптыКлиент.ВыполнитьМетодОбъекта(текЯзык.aliases[0], "toString",, Элементы.ХТМЛ);		
			КонецЕсли;
			Элементы.ТекущийЯзык.СписокВыбора.Добавить(ИД, Синоним);
		КонецЦикла;	
	КонецЕсли;
	ТекущийЯзык = пс_СкриптыКлиент.ВыполнитьКоманду("editor.getModel().getModeId()", Элементы.ХТМЛ);
	
	Элементы.ХТМЛ.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекущийЯзыкПриИзменении(Элемент)
	КомандаСменыЯзыка = СтрШаблон("monaco.editor.setModelLanguage(editor.getModel(), ""%1"");", ТекущийЯзык);
	пс_СкриптыКлиент.ВыполнитьКоманду(КомандаСменыЯзыка, Элементы.ХТМЛ);
КонецПроцедуры











