

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаСоставнойПрогресс.Видимость = Параметры.СоставнойПрогресс;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогресс(текущийПрогресс, текстПодксказки = "") Экспорт
	Прогресс = текущийПрогресс;
	Элементы.ПрогрессПодсказка.Заголовок = текстПодксказки;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСоставнойПрогресс(текущийПрогресс, текстПодстказки = "") Экспорт
	ПрогрессВсего = текущийПрогресс;
	Элементы.СоставнойПрогрессПодсказка.Заголовок = текстПодстказки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьВсе(Команда)
	ОтмененоСоставной = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьТекщий(Команда)
	Отменено = Истина;
КонецПроцедуры


