
&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	Подключить(Истина);	
КонецПроцедуры

&НаКлиенте 
Процедура Подключить(УстановитьЕслиНеПодключено) Экспорт
    НачатьПодключениеРасширенияРаботыСФайлами(
        Новый ОписаниеОповещения(
            "ПослеПодключения",
            ЭтотОбъект,
            УстановитьЕслиНеПодключено));
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключения(Подключено, УстановитьЕслиНеПодключено) Экспорт
    Если Подключено Тогда
     	ВыбратьФайл();   
    ИначеЕсли УстановитьЕслиНеПодключено Тогда
        НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "Подключить",
                ЭтотОбъект,
                Ложь));
    Иначе
    	Сообщить("Не установлено расширение работы с файлами. Загрузка не возможна");
    КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл()
	коллБэк = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите библиотеку, запакованную в ZIP";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "zip";
	Диалог.Фильтр = "(*.zip)|*.zip";
	Диалог.Показать(коллБэк);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыбранныйФайл = ВыбранныеФайлы[0];
	Сообщить(ВыбранныйФайл);
КонецПроцедуры








