
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	ПослеПомещенияФайлов = Новый ОписаниеОповещения("ПослеПомещенияФайлов", ЭтаФорма);	
	Если Копирование Тогда
		МассивФайлов = Новый Массив;		
		МассивФайлов.Добавить(СкопироватьФайлНаСервере(Элемент.ТекущаяСтрока));
		ВыполнитьОбработкуОповещения(ПослеПомещенияФайлов, МассивФайлов);			
	Иначе
		пс_РаботаСФайламиКлиент.ВыбратьФайлы(ПослеПомещенияФайлов, УникальныйИдентификатор);			
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СкопироватьФайлНаСервере(Источник)
	СсылкаНаФайл = Новый Структура;
	СсылкаНаФайл.Вставить("ИдентификаторФайла", Новый УникальныйИдентификатор);
	СсылкаНаФайл.Вставить("Имя", Источник.ИсходноеИмяФайла);
	СсылкаНаФайл.Вставить("Расширение", Источник.ПолноеИмяФайла);
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Адрес", 
		ПоместитьВоВременноеХранилище(Источник.Хранилище.Получить(), УникальныйИдентификатор));
	ОписаниеФайла.Вставить("ПомещениеФайлаОтменено", Ложь);
	ОписаниеФайла.Вставить("СсылкаНаФайл", СсылкаНаФайл);
	Возврат ОписаниеФайла;
КонецФункции

&НаКлиенте
Процедура ПослеПомещенияФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры


