
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	ПараметрыКоманды = Новый Структура();
	ПараметрыКоманды.Вставить("Копирование", 			Копирование);
	ПараметрыКоманды.Вставить("ИсточникКопирования", 	Элемент.ТекущаяСтрока);
	ПараметрыКоманды.Вставить("Устанавливать",			Истина);
	
	
	ПодключитьРасширениеРаботыфайлами(ПараметрыКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьРасширениеРаботыфайлами(ПараметрыКоманды) Экспорт
	ПослеПодключенияРасширения 
		= Новый ОписаниеОповещения("ПослеПодключенияРасширения", ЭтаФорма, ПараметрыКоманды);
	НачатьПодключениеРасширенияРаботыСФайлами(ПослеПодключенияРасширения);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияРасширения(Подключено, ПараметрыКоманды) Экспорт
	Если Не Подключено Тогда
		Если Не ПараметрыКоманды.Устанавливать Тогда
			// TODO: показывать ошибку?
			Возврат;
		КонецЕсли;
		ПараметрыКоманды.Устанавливать = Ложь;
		НачатьУстановкуРасширенияРаботыСФайлами(
			Новый ОписаниеОповещения("ПодключитьРасширениеРаботыфайлами"
				, ЭтаФорма
				, ПараметрыКоманды));
		Возврат;		
	КонецЕсли;
	
	Если ПараметрыКоманды.Копирование Тогда
		
	Иначе
		ПоказатьДиалогВыбораФайловДляЗагрузки();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайловДляЗагрузки()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Истина;
	Диалог.Фильтр = "*.zip|(*.zip)";
	ПослеПомещенияФайлов = Новый ОписаниеОповещения("ПослеПомещенияФайлов", ЭтаФорма);
	НачатьПомещениеФайлов(ПослеПомещенияФайлов, Диалог, , Истина
	, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры


